dot_config/nushell/nushell.org
#+title: NuShell Configuration
#+description: This is the helm from which I manage my shells
#+version: 0.92.2
#+startup: content

* Environment
:PROPERTIES:
:header-args:nushell: :tangle env.nu :comments both
:END:

** Prompts

*** Left Prompt

#+begin_src nushell :cache yes
def create_left_prompt [] {
    let dir = match (do --ignore-shell-errors { $env.PWD | path relative-to $nu.home-path }) {
        null => $env.PWD
        '' => '~'
        $relative_pwd => ([~ $relative_pwd] | path join)
    }

    let path_color = (if (is-admin) { ansi red_bold } else { ansi green_bold })
    let separator_color = (if (is-admin) { ansi light_red_bold } else { ansi light_green_bold })
    let path_segment = $"($path_color)($dir)"

    let path = $path_segment | str replace --all (char path_sep) $"($separator_color)(char path_sep)($path_color)"
    let overlay = overlay list | last | if $in != zero { $" (ansi yellow)\(($in)\)" } else { "" }

    $"($path)($overlay)"
}
#+end_src

#+RESULTS[e35260650063be5ad74f0280832b9bccb1643c89]:

*** Right Prompt

#+begin_src nushell :cache yes
def create_right_prompt [] {
    # create a right prompt in magenta with green separators and am/pm underlined
    let time_segment = ([
        (ansi reset)
        (ansi magenta)
        (date now | format date '%x %X') # try to respect user's locale
    ] | str join | str replace --regex --all "([/:])" $"(ansi green)${1}(ansi magenta)" |
        str replace --regex --all "([AP]M)" $"(ansi magenta_underline)${1}")

    let last_exit_code = if ($env.LAST_EXIT_CODE != 0) {([
        (ansi rb)
        ($env.LAST_EXIT_CODE)
    ] | str join)
    } else { "" }

    ([$last_exit_code, (char space), $time_segment] | str join)
}
#+end_src

#+RESULTS[fe246fb9992dc67a7f44a6bae6b99d822039e7bb]:

*** Indicators

#+begin_src nushell :cache yes
# Use nushell functions to define your right and left prompt
# $env.PROMPT_COMMAND = {|| create_left_prompt }
# FIXME: This default is not implemented in rust code as of 2023-09-08.
# $env.PROMPT_COMMAND_RIGHT = {|| create_right_prompt }

# The prompt indicators are environmental variables that represent
# the state of the prompt
$env.PROMPT_INDICATOR = {|| "> " }
$env.PROMPT_INDICATOR_VI_INSERT = {|| "> " }
$env.PROMPT_INDICATOR_VI_NORMAL = {|| ": " }
$env.PROMPT_MULTILINE_INDICATOR = {|| "::: " }

# If you want previously entered commands to have a different prompt from the usual one,
# you can uncomment one or more of the following lines.
# This can be useful if you have a 2-line prompt and it's taking up a lot of space
# because every command entered takes up 2 lines instead of 1. You can then uncomment
# the line below so that previously entered commands show with a single `ðŸš€`.
# $env.TRANSIENT_PROMPT_COMMAND = {|| "ðŸš€ " }
# $env.TRANSIENT_PROMPT_INDICATOR = {|| "" }
# $env.TRANSIENT_PROMPT_INDICATOR_VI_INSERT = {|| "" }
# $env.TRANSIENT_PROMPT_INDICATOR_VI_NORMAL = {|| "" }
# $env.TRANSIENT_PROMPT_MULTILINE_INDICATOR = {|| "" }
# $env.TRANSIENT_PROMPT_COMMAND_RIGHT = {|| "" }
#+end_src

#+RESULTS[711956e3e066907bbdcf4a631d05103fa1aea118]:

** Environment Variable Conversions

Specifies how environment variables are:

- converted from a string to a value on Nushell startup (from_string)
- converted from a value back to a string when running external commands (to_string)

Note: The conversions happen *after* config.nu is loaded

#+begin_src nushell :cache yes
$env.ENV_CONVERSIONS = {
    "PATH": {
        from_string: { |s| $s | split row (char esep) | path expand --no-symlink }
        to_string: { |v| $v | path expand --no-symlink | str join (char esep) }
    }
    "Path": {
        from_string: { |s| $s | split row (char esep) | path expand --no-symlink }
        to_string: { |v| $v | path expand --no-symlink | str join (char esep) }
    }
}
#+end_src

#+RESULTS[475f9192a2c0702705375fcbfd1c2f4d65742cdc]:

** Library Directories

Directories to search for scripts when calling source or use. The default for this is =$nu.default-config-dir/scripts=

#+name: nu-primary-lib-dir
#+begin_src nushell :tangle no :cache yes :results none
($nu.default-config-dir | path join scripts)
#+end_src

#+RESULTS[5ed25a1224323d4aa1f18220f72123762a00703d]: nu-primary-lib-dir
: /Users/michael/.config/nushell/scripts

#+begin_src nushell :var primary=nu-primary-lib-dir() :cache yes
$env.NU_LIB_DIRS = [
  $primary
  ($nu.default-config-dir | path join nu_scripts)
]
#+end_src

#+RESULTS[a44f5aecb06c47f0a534dee49f94a16ea9b5a574]:

Directories to search for plugin binaries when calling register. The default for this is =$nu.default-config-dir/plugins=

#+begin_src nushell :cache yes
$env.NU_PLUGIN_DIRS = [
  ($nu.default-config-dir | path join 'plugins') # add <nushell-config-dir>/plugins
]
#+end_src

#+RESULTS[2ae03b9a8ef622a6a644f9af2181ed946db1afc3]:

** PATH

To add entries to PATH (on Windows you might use Path), you can use the following pattern:

#+begin_src nushell :tangle no :cache yes
$env.PATH = ($env.PATH | split row (char esep) | prepend '/some/path')
#+end_src

#+RESULTS[0cb4894eccb49abb9c8241213e06ab05e74c0ff1]:

An alternate way to add entries to $env.PATH is to use the custom command ~path add~ which is built into the nushell stdlib:

#+begin_src nushell :tangle no :cache yes
use std "path add"
$env.PATH = ($env.PATH | split row (char esep))
path add /some/path
path add ($env.CARGO_HOME | path join "bin")
path add ($env.HOME | path join ".local" "bin")
$env.PATH = ($env.PATH | uniq)
#+end_src

#+RESULTS[95dd5600ce27b3edc0301edbfcc12672fc3d34f8]:

** Environment Variables

#+begin_src nushell :cache yes
$env.EDITOR = "nvim"
$env.VISUAL = "nvim"
$env.HOMEBREW_EDITOR = "emacsclient --create-frame --no-wait --alternate-editor ''"
#+end_src

#+RESULTS[14daf2817de871c7f33d2f948066da68f8a176b6]:

** Additional Files

To load from a custom file you can use:

#+begin_src nushell :tangle no :cache yes
# source ($nu.default-config-dir | path join 'custom.nu')
#+end_src

#+RESULTS[3ae8e25a5c14e4d6e6140e8a90b745f0173d385d]:

* Configuration
:PROPERTIES:
:header-args:nushell: :tangle config.nu :comments 'both'
:END:

** Themes

- For more information on defining custom themes, see https://www.nushell.sh/book/coloring_and_theming.html
- And here is the theme collection: https://github.com/nushell/nu_scripts/tree/main/themes

*** Dark

#+begin_src nushell :eval no
let dark_theme = {
    # color for nushell primitives
    separator: white
    leading_trailing_space_bg: { attr: n } # no fg, no bg, attr none effectively turns this off
    header: green_bold
    empty: blue
    # Closures can be used to choose colors for specific values.
    # The value (in this case, a bool) is piped into the closure.
    # eg) {|| if $in { 'light_cyan' } else { 'light_gray' } }
    bool: light_cyan
    int: white
    filesize: cyan
    duration: white
    date: purple
    range: white
    float: white
    string: white
    nothing: white
    binary: white
    cell-path: white
    row_index: green_bold
    record: white
    list: white
    block: white
    hints: dark_gray
    search_result: { bg: red fg: white }
    shape_and: purple_bold
    shape_binary: purple_bold
    shape_block: blue_bold
    shape_bool: light_cyan
    shape_closure: green_bold
    shape_custom: green
    shape_datetime: cyan_bold
    shape_directory: cyan
    shape_external: cyan
    shape_externalarg: green_bold
    shape_external_resolved: light_yellow_bold
    shape_filepath: cyan
    shape_flag: blue_bold
    shape_float: purple_bold
    # shapes are used to change the cli syntax highlighting
    shape_garbage: { fg: white bg: red attr: b}
    shape_globpattern: cyan_bold
    shape_int: purple_bold
    shape_internalcall: cyan_bold
    shape_keyword: cyan_bold
    shape_list: cyan_bold
    shape_literal: blue
    shape_match_pattern: green
    shape_matching_brackets: { attr: u }
    shape_nothing: light_cyan
    shape_operator: yellow
    shape_or: purple_bold
    shape_pipe: purple_bold
    shape_range: yellow_bold
    shape_record: cyan_bold
    shape_redirection: purple_bold
    shape_signature: green_bold
    shape_string: green
    shape_string_interpolation: cyan_bold
    shape_table: blue_bold
    shape_variable: purple
    shape_vardecl: purple
}
#+end_src

*** Light

#+begin_src nushell :eval no
let light_theme = {
    # color for nushell primitives
    separator: dark_gray
    leading_trailing_space_bg: { attr: n } # no fg, no bg, attr none effectively turns this off
    header: green_bold
    empty: blue
    # Closures can be used to choose colors for specific values.
    # The value (in this case, a bool) is piped into the closure.
    # eg) {|| if $in { 'dark_cyan' } else { 'dark_gray' } }
    bool: dark_cyan
    int: dark_gray
    filesize: cyan_bold
    duration: dark_gray
    date: purple
    range: dark_gray
    float: dark_gray
    string: dark_gray
    nothing: dark_gray
    binary: dark_gray
    cell-path: dark_gray
    row_index: green_bold
    record: dark_gray
    list: dark_gray
    block: dark_gray
    hints: dark_gray
    search_result: { fg: white bg: red }
    shape_and: purple_bold
    shape_binary: purple_bold
    shape_block: blue_bold
    shape_bool: light_cyan
    shape_closure: green_bold
    shape_custom: green
    shape_datetime: cyan_bold
    shape_directory: cyan
    shape_external: cyan
    shape_externalarg: green_bold
    shape_external_resolved: light_purple_bold
    shape_filepath: cyan
    shape_flag: blue_bold
    shape_float: purple_bold
    # shapes are used to change the cli syntax highlighting
    shape_garbage: { fg: white bg: red attr: b}
    shape_globpattern: cyan_bold
    shape_int: purple_bold
    shape_internalcall: cyan_bold
    shape_keyword: cyan_bold
    shape_list: cyan_bold
    shape_literal: blue
    shape_match_pattern: green
    shape_matching_brackets: { attr: u }
    shape_nothing: light_cyan
    shape_operator: yellow
    shape_or: purple_bold
    shape_pipe: purple_bold
    shape_range: yellow_bold
    shape_record: cyan_bold
    shape_redirection: purple_bold
    shape_signature: green_bold
    shape_string: green
    shape_string_interpolation: cyan_bold
    shape_table: blue_bold
    shape_variable: purple
    shape_vardecl: purple
}
#+end_src

** Completion

#+begin_src nushell :tangle no :eval no
# External completer example
# let carapace_completer = {|spans|
#     carapace $spans.0 nushell ...$spans | from json
# }
#+end_src

#+RESULTS:

