dot_config/nushell/nushell.org
** NuShell Scripts

Load scripts from [[https://github.com/nushell/nu_scripts][nu_scripts]] repo.

*** Themes

#+begin_src nushell
# Setup nushell theme
# use nu_scripts/themes/nu-themes/rose-pine.nu
# $env.config = ($env.config | merge {color_config: (rose-pine)})
#+end_src

#+RESULTS:

*** Completions

Setup custom completions

#+begin_src nushell
use nu_scripts/custom-completions/bat/bat-completions.nu *
use nu_scripts/custom-completions/composer/composer-completions.nu *
use nu_scripts/custom-completions/curl/curl-completions.nu *
use nu_scripts/custom-completions/gh/gh-completions.nu *
use nu_scripts/custom-completions/git/git-completions.nu *
use nu_scripts/custom-completions/glow/glow-completions.nu *
use nu_scripts/custom-completions/just/just-completions.nu *
use nu_scripts/custom-completions/less/less-completions.nu *
#+end_src

#+RESULTS:

** Third-Party Setup
*** ASDF
#+begin_src nushell
$env.ASDF_DIR = (brew --prefix asdf | str trim | into string | path join 'libexec')
 source /opt/homebrew/opt/asdf/libexec/asdf.nu
#+end_src

#+RESULTS:

** Custom Modules

#+begin_src nushell
use edit.nu
use rose-pine.nu
use xdg.nu
use follow.nu
use wm.nu
use my
use chezmoi
overlay use aliases.nu
overlay use --prefix service.nu
overlay use --prefix pueue.nu
#+end_src

* Modules

Writing modules in nushell is a way to reuse code between other scripts, as well as creating command line tools.

I'd like to tangle them all into the same root directory, so I'll create a block below whose output I can use while creating header arguments for the sub-headings.

** XDG
:PROPERTIES:
:header-args:nushell: :tangle scripts/xdg.nu :comments 'both'
:END:

These are just some little scripts to make creating XDG file paths. The [[https://wiki.archlinux.org/title/XDG_Base_Directory][Arch Linux docs]] have some good details about how this is supposed to work.

*** XDG_CONFIG_HOME

- Where user-specific configurations should be written (analogous to /etc).
- Should default to =$HOME/.config=.

**** Definition

#+name: xdg-config
#+begin_src nushell :results silent
# Construct an absolute path from XDG_CONFIG_HOME
export def config [
  ...path: string # The path segments to join
] -> string {
  $env.XDG_CONFIG_HOME | default [$env.HOME .config]
    | path join ...$path
}
#+end_src

**** Example

#+name: xdg-config-example
#+begin_src nushell :noweb yes :tangle no
<<xdg-config>>
config | print
config nushell this is a really good example
#+end_src

#+RESULTS: xdg-config-example
: /Users/michael/.config
: /Users/michael/.config/nushell/this/is/a/really/good/example

*** XDG_CACHE_HOME

- Where user-specific non-essential (cached) data should be written (analogous to /var/cache).
- Should default to =$HOME/.cache=.

**** Definition

#+name: xdg-cache
#+begin_src nushell :results silent
# Construct an absolute path from XDG_CACHE_HOME
export def cache [
  ...path: string
] -> string {
  $env.XDG_CACHE_HOME
    | default ([$env.HOME .cache])
    | path join ...$path
}
#+end_src

**** Example

#+name: xdg-cache-example
#+begin_src nushell :noweb yes :tangle no
<<xdg-cache>>
cache | print
cache this is a great example actually
#+end_src

#+RESULTS: xdg-cache-example
: /Users/michael/.cache
: /Users/michael/.cache/this/is/a/great/example/actually

*** XDG_DATA_HOME

- Where user-specific data files should be written (analogous to /usr/share).
- Should default to =$HOME/.local/share=.

**** Definition

#+name: xdg-data
#+begin_src nushell :results silent
# Construct an absolute path from XDG_DATA_HOME
export def data [
  ...path: string
] -> string {
  $env.XDG_DATA_HOME
    | default ([$env.HOME .local state])
    | path join ...$path
}
#+end_src

**** Example

#+name: xdg-data-example
#+begin_src nushell :noweb yes :tangle no
<<xdg-data>>
data | print
data this is a great example actually
#+end_src

#+RESULTS: xdg-data-example
: /Users/michael/.local/share
: /Users/michael/.local/share/this/is/a/great/example/actually

*** XDG_STATE_HOME

- Where user-specific state files should be written (analogous to /var/lib).
- Should default to =$HOME/.local/state=.

**** Definition

#+name: xdg-state
#+begin_src nushell :results silent
# Construct an absolute path from XDG_STATE_HOME
export def state [
  ...path: string
] -> string {
  $env.XDG_STATE_HOME
    | default ([$env.HOME .local state])
    | path join ...$path
}
#+end_src

**** Example

#+name: xdg-state-example
#+begin_src nushell :noweb yes :tangle no
<<xdg-state>>
state | print
state this is a great example actually
#+end_src

#+RESULTS: xdg-state-example
: /Users/michael/.local/state
: /Users/michael/.local/state/this/is/a/great/example/actually

*** XDG_RUNTIME_DIR

- Used for non-essential, user-specific data files such as sockets, named pipes, etc.
- Not required to have a default value; warnings should be issued if not set or equivalents provided.
- Must be owned by the user with an access mode of 0700.
- Filesystem fully featured by standards of OS.
- Must be on the local filesystem.
- May be subject to periodic cleanup.
- Modified every 6 hours or set sticky bit if persistence is desired.
- Can only exist for the duration of the user's login.
- Should not store large files as it may be mounted as a tmpfs.
- pam_systemd sets this to =/run/user/$UID=.

**** Definition

#+name: xdg-runtime
#+begin_src nushell :results silent
# Construct an absolute path from XDG_RUNTIME_DIR
export def runtime [
  ...path: string
] -> string {
  $env.XDG_RUNTIME_DIR
    | default ([$env.HOME .local state])
    | path join ...$path
}
#+end_src

**** Example

#+name: xdg-runtime-example
#+begin_src nushell :noweb yes :tangle no
<<xdg-runtime>>
runtime | print
runtime this is a great example actually
#+end_src

#+RESULTS: xdg-runtime-example
: /var/folders/rb/3dlc977d1xd_5m1fz4sg3q2r0000gn/T/
: /var/folders/rb/3dlc977d1xd_5m1fz4sg3q2r0000gn/T/this/is/a/great/example/actually
** Pueue
:PROPERTIES:
:header-args:nushell: :tangle (expand-file-name "pueue.nu" (org-sbe nu-primary-lib-dir)) :mkdirp t
:END:

I work with [[https://github.com/Nukesor/pueue][pueue]] a lot, and I've got some convenience wrappers I like to use to make it easier to deal with it in nushell.

*** Status

This script simply wraps the status command output as a table whose shape is a bit easier to work with.

#+begin_src nushell

# Get output as table
export def status --wrapped [...args] {
  $args | filter {|x| $x != "--json" and $x != "-j"}
    | if "-h" in $in or "--help" in $in {
        ^pueue status --help
      } else {
        ^pueue status ...$in --json
          | from json
          | transpose name details
          | each { upsert details { transpose name details } }
          | reduce --fold {} {|it, acc| $acc | upsert $it.name $it.details }
      }
}
#+end_src

#+RESULTS:

** Service
:PROPERTIES:
:header-args:nushell: :tangle (expand-file-name "service.nu" (org-sbe nu-primary-lib-dir)) :comments 'link' :results silent
:END:

This module helps me start, stop, and monitor services that I run regularly via homebrew, pueue, or elsewhere.

*** Main

#+begin_src nushell
export def main [] {
    "Commands for interacting with long-running services."
}
#+end_src

We need a place to define all of our services that can be referenced from multiple commands.

#+begin_src nushell
def service-definitions [] {
    [
      [name        type  command];
      [yabai       pueue null]
      [skhd        pueue null]
      [borders     pueue null]
      [sketchybar  pueue null]
      [dark-notify pueue 'dark-notify -c "tmux source-file ~/.config/tmux/tmux.conf"']
    ]
}
#+end_src

And then we'll want a few ways to slice-and-dice those definitions.

#+begin_src nushell
def service-names [] {
  service-definitions | get name
}

def service-command [service: string@service-names] {
  service-definitions | where name == $service | get command.0
}
#+end_src

*** Start

Now, on to the meat-and-potatoes! I like using [[https://github.com/Nukesor/pueue][pueue]] to manage most of my processes. As such, I'll set up a helper function to get services started running.

#+begin_src nushell
def start-with-pueue [
    group: string, # The name of the group
    command?: string # The command to pass, else just use the group name
] {
    use pueue.nu

    pueue status | get groups | where name == $group
    | if ($in | is-empty) {
        ^pueue groups add $group
    }

    pueue status | get tasks.details | where group == $group
    | if ($in | is-empty) {
        with-env { SHELL: nu-login } {
            ^pueue add --group $group --working-directory ~ -- ($command | default $group)
        }
        ^pueue start --group $group
        } else {
            pueue status | get tasks.details
                | where group == $group
                | each { ^pueue kill $in.id }
            pueue clean --group $group
            start-with-pueue $group $command
        }
}
#+end_src

With all these pieces in place, we can now assemle our first user-facing command.

#+begin_src nushell
# Start a service
export def start [
    service: string@service-names, # The name of the service
] {
    start-with-pueue $service (service-command $service)
}
#+end_src

Now, let's check and see if it worked.

#+name: service-start-test
#+begin_src nushell :tangle no :results output replace
service start skhd
#+end_src

#+RESULTS: service-start-test
: All finished tasks have been removed from group 'skhd'
: New task added (id 36).
: Group "skhd" is being resumed.

Great! Now, it'd be good to have a way to check the status of the service.

