dot_config/nushell/exact_scripts/service.nu
# [[file:../nushell.org::*Main][Main:1]]
export def main [] {
    "Commands for interacting with long-running services."
}
# Main:1 ends here

# [[file:../nushell.org::*Main][Main:2]]
def service-definitions [] {
    [
      [name        type  command];
      [yabai       pueue null]
      [skhd        pueue null]
      [borders     pueue null]
      [sketchybar  pueue null]
      [dark-notify pueue 'dark-notify -c "tmux source-file ~/.config/tmux/tmux.conf"']
    ]
}
# Main:2 ends here

# [[file:../nushell.org::*Main][Main:3]]
def service-names [] {
  service-definitions | get name
}

def service-command [service: string@service-names] {
  service-definitions | where name == $service | get command.0
}
# Main:3 ends here

# [[file:../nushell.org::*Start][Start:1]]
def start-with-pueue [
    group: string, # The name of the group
    command?: string # The command to pass, else just use the group name
] {
    use pueue.nu

    pueue status | get groups | where name == $group
    | if ($in | is-empty) {
        ^pueue groups add $group
    }

    pueue status | get tasks.details | where group == $group
    | if ($in | is-empty) {
        with-env { SHELL: nu-login } {
            ^pueue add --group $group --working-directory ~ -- ($command | default $group)
        }
        ^pueue start --group $group
        } else {
            pueue status | get tasks.details
                | where group == $group
                | each { ^pueue kill $in.id }
            pueue clean --group $group
            start-with-pueue $group $command
        }
}
# Start:1 ends here

# [[file:../nushell.org::*Start][Start:2]]
# Start a service
export def start [
    service: string@service-names, # The name of the service
] {
    start-with-pueue $service (service-command $service)
}
