dot_config/nushell/nushell.org
*** Status

Again, we'll want a helper function for our pueue services.

#+begin_src nushell
def status-with-pueue [] {
  use pueue.nu

  pueue status | get tasks.details | select group status command
    | rename -c { group: service }
    | upsert status {
        match ($in | describe -d | get type) {
          record => ($in | items {|k,v| $"($k): ($v)"} | first),
          _ => $in
        }
    }
}
#+end_src

Which we can use for our user-facing command:

#+begin_src nushell
# Get the status of a running service
export def status [
    service?: string@service-names
    --verbose (-v) # Show extra output
] {
    status-with-pueue | if $verbose { $in } else { $in | reject command }
    | if ($service | is-not-empty) {
      $in | where service == $service
    } else { $in }
}
#+end_src

That produces the following output showing an overview of statuses.

- [X] Basic invocation
        #+name: service-status-test
        #+begin_src nushell :tangle no :results replace output
        service status
        #+end_src

        #+RESULTS: service-status-test
        : â•­â”€â”€â”€â”¬â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¬â”€â”€â”€â”€â”€â”€â”€â”€â”€â•®
        : â”‚ # â”‚   service   â”‚ status  â”‚
        : â”œâ”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¤
        : â”‚ 0 â”‚ dark-notify â”‚ Running â”‚
        : â”‚ 1 â”‚ sketchybar  â”‚ Running â”‚
        : â”‚ 2 â”‚ borders     â”‚ Running â”‚
        : â”‚ 3 â”‚ yabai       â”‚ Running â”‚
        : â”‚ 4 â”‚ skhd        â”‚ Running â”‚
        : â•°â”€â”€â”€â”´â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”´â”€â”€â”€â”€â”€â”€â”€â”€â”€â•¯
- [X] With verbose
        #+name: service-status-detailed-test
        #+begin_src nushell :tangle no :results replace output
        service status -v
        #+end_src

        #+RESULTS: service-status-detailed-test
        #+begin_example
        â•­â”€â”€â”€â”¬â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¬â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¬â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â•®
        â”‚ # â”‚   service   â”‚ status  â”‚                     command                      â”‚
        â”œâ”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¤
        â”‚ 0 â”‚ dark-notify â”‚ Running â”‚ dark-notify -c "tmux source-file                 â”‚
        â”‚   â”‚             â”‚         â”‚ ~/.config/tmux/tmux.conf"                        â”‚
        â”‚ 1 â”‚ sketchybar  â”‚ Running â”‚ sketchybar                                       â”‚
        â”‚ 2 â”‚ borders     â”‚ Running â”‚ borders                                          â”‚
        â”‚ 3 â”‚ yabai       â”‚ Running â”‚ yabai                                            â”‚
        â”‚ 4 â”‚ skhd        â”‚ Running â”‚ skhd                                             â”‚
        â•°â”€â”€â”€â”´â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”´â”€â”€â”€â”€â”€â”€â”€â”€â”€â”´â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â•¯
        #+end_example
- [X] With individual service
        #+name: service-status-single-test
        #+begin_src nushell :tangle no :results replace output
        service status skhd
        #+end_src

        #+RESULTS: service-status-single-test
        : â•­â”€â”€â”€â”¬â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¬â”€â”€â”€â”€â”€â”€â”€â”€â”€â•®
        : â”‚ # â”‚ service â”‚ status  â”‚
        : â”œâ”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¤
        : â”‚ 0 â”‚ skhd    â”‚ Running â”‚
        : â•°â”€â”€â”€â”´â”€â”€â”€â”€â”€â”€â”€â”€â”€â”´â”€â”€â”€â”€â”€â”€â”€â”€â”€â•¯

*** Stop

We'll need to handle pueue services specially again, so I'll create another helper function for that.

#+begin_src nushell
def stop-with-pueue [group: string] {
  use pueue.nu

  pueue status | get tasks.details | where group == $group
  | each { pueue kill $in.id }

  pueue clean -g $group
}
#+end_src

#+begin_src nushell
# Stop a service
export def stop [
    service: string@service-names, # The name of the service
] {
    stop-with-pueue $service
}
#+end_src

#+name: service-stop-test
#+begin_src nushell :tangle no :results output replace
service stop skhd
#+end_src

#+RESULTS: service-stop-test
: All finished tasks have been removed from group 'skhd'

#+name: services-stop-status
#+begin_src nushell :tangle no :results output replace :noweb yes
<<service-stop-test>>
service status skhd | to text
#+end_src

#+RESULTS: services-stop-status
: All finished tasks have been removed from group 'skhd'

*** Logs

I also want a way to check out the logs for the currently running services.

**** Helper function for pueue

For that, I'll need a trusty helper function again.

#+begin_src nushell
def logs-with-pueue [
    group: string
    --follow (-f)
] {
    ^pueue status --json | from json | get tasks | values
        | where group == $group and status == Running
        | get id.0
        | do {|x|
            pueue log $x
            if ($follow) {
                pueue follow $x
            }
        } $in
}
#+end_src

**** Public facing command

And, then of course, I'll expose my public facing API

#+begin_src nushell
# View the logs for a running process
export def logs [
    service: string@service-names
    --follow (-f) # Follow logs after the initial dump
] {
    logs-with-pueue $service --follow=$follow
}
#+end_src

This should produce output like the following:

**** Normal invocation

#+name: service-logs-output
#+begin_src nushell :tangle no :results output replace
service logs skhd
#+end_src

#+RESULTS: service-logs-output

**** With follow flag
  
This command presumes there's a TTY attached, and will hang if run as a code block.

#+name: service-logs-follow
#+begin_src nushell :tangle no :results output replace :eval no
service logs skhd -f
#+end_src
*** Restart

Of course, we might want to explicitly restart one service or another. This isn't as important with pueue services, but it is for brew services. So we'll make a standard API to help with that. First, the helper function:

#+begin_src nushell
def restart-with-pueue [group: string] {
  stop-with-pueue $group
  start-with-pueue $group (service-command $group)
}
#+end_src

Now we can make the public API:

#+begin_src nushell
# Restart a service
export def restart [
  service: string@service-names, # The name of the service
] {
  restart-with-pueue $service
}
#+end_src

#+name: services-restart-test
#+begin_src nushell :tangle no :results output replace
service restart skhd
#+end_src

#+RESULTS: services-restart-test
: All finished tasks have been removed from group 'skhd'
: New task added (id 36).
: Group "skhd" is being resumed.

#+name: services-restart-status
#+begin_src nushell :tangle no :results output replace :noweb yes
<<services-restart-test>>
service status skhd | to text
#+end_src

#+RESULTS: services-restart-status
: All finished tasks have been removed from group 'skhd'
: All finished tasks have been removed from group 'skhd'
: New task added (id 36).
: Group "skhd" is being resumed.
: service: skhd
: status: Running

** Aliases
:PROPERTIES:
:header-args:nushell: :tangle (expand-file-name "aliases.nu" (org-sbe nu-primary-lib-dir)) :mkdirp t
:END:

#+begin_src nushell
use chezmoi

export alias c        = ^chezmoi
export alias e        = ^$env.EDITOR
export alias j        = just --highlight
export alias lazynvim = nvim --headless "+Lazy! sync" +qa
export alias lg       = lazygit
export alias sail     = vendor/bin/sail
export alias v        = ^$env.VISUAL
export alias q        = ^pueue

# Start yazi file manager with cd on exit
export def --env yy [...args] {
  let tmp = (mktemp -t "yazi-cwd.XXXXXX")
  yazi ...$args --cwd-file $tmp
  let cwd = (open $tmp)
  if $cwd != "" and $cwd != $env.PWD {
    cd $cwd
  }
  rm -fp $tmp
}

export def --wrapped artisan [...args] {
  if ('vendor/bin/sail' | path exists) {
    print -e "ðŸ³ Running in docker..."
    vendor/bin/sail artisan ...$args
  } else {
    php artisan ...$args
  }
}

export def --wrapped please [...args] {
  if ('vendor/bin/sail' | path exists) {
    print -e "ðŸ³ Running in docker..."
    vendor/bin/sail php please ...$args
  } else {
    php please ...$args
  }
}

export def --wrapped composer [...args] {
  if ('vendor/bin/sail' | path exists) {
    print -e "ðŸ³ Running in docker..."
    vendor/bin/sail composer ...$args
  } else {
    ^composer ...$args
  }
}
#+end_src

#+RESULTS:

** Edit
:PROPERTIES:
:header-args:nushell: :tangle (expand-file-name "edit.nu" (org-sbe nu-primary-lib-dir)) :mkdirp t
:END:

#+begin_src nushell
use xdg.nu

def editor [...args: any] {
  run-external $env.EDITOR ...$args
}

def scripts-path [
  ...paths: string
] {
  ($nu.default-config-dir | path join scripts ...$paths)
}

def enter-edit [
  ...paths: string
] {
  $paths | path join
    | match ($in | path type) {
        dir => { enter ($in) },
        _ => { enter ($in | path dirname); ($in | path basename) }
      }
    | if ($in | is-not-empty) {
        editor $in
      } else {
        editor
      }
  dexit
}

def names [context: string] {
  const both = [yabai skhd chezmoi borders sketchybar]

  ["-n" "--nushell"] | any { $context =~ $in}
    | if $in {
        [brew pueue wm follow rose-pine aliases] ++ $both
      } else {
        [tmux nvim wezterm] ++ $both
      }
    | sort
}

export def main [
  name?: string@names
  --nushell (-n)
] {
  if ($nushell) {
    scripts-path $name
    | if ($in | path exists) {
        $in
      } else if ($in | $"($in).nu" | path exists) {
        $"($in).nu"
      } else {
        print -e $"($name) is not a nushell module."
        return
      }
  } else {
    if $name == null {
      scripts-path edit.nu
    } else {
      xdg config $name | if ($in | path exists) { $in } else {
        print -e $"($in) does not exist."
        return
      }
    }
  }
  | enter-edit $in
}

#+end_src
** Rose Pine
:PROPERTIES:
:header-args:nushell: :tangle (expand-file-name "rose-pine.nu" (org-sbe nu-primary-lib-dir)) :mkdirp t :comments link
:END:

This little module is useful for setting colors other places.

*** Theme Definitions

First, we'll create a data structure we can query that defines the themes's colors in undecorated hexadecimal format.

#+begin_src nushell
def themes [] {
  [
    [role    dark   moon   dawn ];
    [base    191724 232136 faf4ed]
    [surface 1f1d2e 2a273f fffaf3]
    [overlay 26233a 393552 f2e9e1]
    [muted   6e6a86 6e6a86 9893a5]
    [subtle  908caa 908caa 797593]
    [text    e0def4 e0def4 575279]
    [love    eb6f92 eb6f92 b4637a]
    [gold    f6c177 f6c177 ea9d34]
    [rose    ebbcba ea9a97 d7827e]
    [pine    31748f 3e8fb0 286983]
    [foam    9ccfd8 9ccfd8 56949f]
    [iris    c4a7e7 c4a7e7 907aa9]
    [hi-low  21202e 2a283e f4ede8]
    [hi-med  403d52 44415a dfdad9]
    [hi-high 524f67 56526e cecacd]
  ]
}
#+end_src

**** Completion functions

We won't use this interactively much, but if we did...here's some completions

#+begin_src nushell
def variants [] {
  themes | columns | drop nth 0
}
#+end_src

#+begin_src nushell
def role [] {
  themes | get role
}
#+end_src

#+begin_src nushell
def format [] {
  [argb rgb]
}
#+end_src

*** Main function

Finally, we'll bring it all together in a single lil function.

#+begin_src nushell
export def main [
  variant: string@variants,
  role: string@role,
] {
  themes | where role == $role
    | (get $variant).0
}
#+end_src

** Window Manager
:PROPERTIES:
:header-args:nushell: :tangle (expand-file-name "wm.nu" (org-sbe nu-primary-lib-dir)) :mkdirp t :comments link
:END:

We're using [[https://github.com/koekeishiya/yabai][yabai]] as our window manager, and [[https://github.com/koekeishiya/skhd][skhd]] to handle our hotkey invocations. While SKHD is configured elsewhere, we will want to create a file with our yabai-specific bindings. We can weave these key declarations in to this document if we can grab the default file location as a variable to use while tangling.

#+name: skhdrc
#+begin_src nushell :tangle no :cache yes
(xdg config skhd yabai)
#+end_src

#+RESULTS[a42a2981f8f042a44dad4233808a9017c5e90f80]: skhdrc
: /Users/michael/.config/skhd/yabai

*** root

#+begin_src nushell
# Restart the window manager
export def restart [] {
  use service.nu
  service restart yabai
}

# Commands for working with the window manager
export def main [] {
  help wm
}
#+end_src

