dot_config/nushell/nushell.org
*** mode

#+begin_src nushell
export module mode {
    use rose-pine

    export def default [] {
        print "DEFAULT mode"
        (
            borders
            $"active_color=0xff(rose-pine dark foam)"
            $"inactive_color=0x88(rose-pine dark base)"
            style=round
            width=8
        )
    }

    export def win [] {
        print "WIN mode"
        (
            borders
            width=12
            style=round
            $"active_color=0xff(rose-pine dark gold)"
            $"inactive_color=0x44(rose-pine dark base)"
        )
    }

    export def spc [] {
        print "SPC mode"
        (
            borders
            width=16
            style=square
            $"active_color=0xff(rose-pine dark love)"
            $"inactive_color=0x88(rose-pine dark rose)"
        )
    }

    export def go-back [] {
        print "Go back one mode"
        skhd -k escape
    }

    export def goto-root [] {
        print "Return to root mode"
        skhd -k shift - escape
    }
}
#+end_src

*** space

#+begin_src nushell
export module space {
    export def equalize [] {
        yabai -m space --equalize
    }

    export def balance [] {
        yabai -m space --balance
    }

    export def create [] {
        yabai -m space --create
    }

    export def destroy [] {
        let id = (yabai -m query --displays --display | from json
            | get spaces | last)
        yabai -m space --destroy $id
    }

    export def flip-x [] {
        yabai -m space --mirror x-axis
    }

    export def flip-y [] {
        yabai -m space --mirror y-axis
    }

    export def flip-xy [] {
        flip-x
        flip-y
    }

    export module focus {
        export def main [selector: string] {
            yabai -m space --focus $selector
        }

        export def next [] {
            yabai -m space --focus next
            sleep 0.2sec
            yabai -m window --focus first
        }

        export def prev [] {
            yabai -m space --focus prev
            sleep 0.2sec
            yabai -m window --focus first
        }
    }

    export module rotate {
        export def cw [] {
            yabai -m space --rotate 270
        }

        export def ccw [] {
            yabai -m space --rotate 90
        }

        export def main [] {
            ccw
        }
    }
}
#+end_src

