dot_config/nushell/exact_scripts/wm.nu
# [[file:../nushell.org::*space][space:1]]
export module space {
    export def equalize [] {
        yabai -m space --equalize
    }

    export def balance [] {
        yabai -m space --balance
    }

    export def create [] {
        yabai -m space --create
    }

    export def destroy [] {
        let id = (yabai -m query --displays --display | from json
            | get spaces | last)
        yabai -m space --destroy $id
    }

    export def flip-x [] {
        yabai -m space --mirror x-axis
    }

    export def flip-y [] {
        yabai -m space --mirror y-axis
    }

    export def flip-xy [] {
        flip-x
        flip-y
    }

    export module focus {
        export def main [selector: string] {
            yabai -m space --focus $selector
        }

        export def next [] {
            yabai -m space --focus next
            sleep 0.2sec
            yabai -m window --focus first
        }

        export def prev [] {
            yabai -m space --focus prev
            sleep 0.2sec
            yabai -m window --focus first
        }
    }

    export module rotate {
        export def cw [] {
            yabai -m space --rotate 270
        }

        export def ccw [] {
            yabai -m space --rotate 90
        }

        export def main [] {
            ccw
        }
    }
}
