dot_config/nushell/nushell.org
** ZSH

Because NuShell isn't POSIX compliant, it doesn't make sense to use it for our login =$SHELL=. Lots of programs expect that POSIX compliance from the system shell, so goofing with that isn't a good idea. NuShell knows that, and it lets you inherit environment variables from your system shell that will be available in your =env.nu= and =config.nu= files, as well as any interactive shell. So, let's define our =.zshenv= file here.

#+begin_src sh :tangle ~/.zshenv :eval no :comments both
export XDG_CONFIG_HOME="${XDG_CONFIG_HOME:-$HOME/.config}"
[[ -d $XDG_CONFIG_HOME/zsh ]] && export ZDOTDIR="$XDG_CONFIG_HOME/zsh"
source "$ZDOTDIR/.zshenv"
#+end_src

*** Env Configuration
:PROPERTIES:
:header-args:sh: :tangle ~/.config/zsh/.zshenv :eval no :mkdirp t :comments both
:END:

Of course, this doesn't actually give us what we want. It just asks =zsh= if it would kindly load the =.zshenv= file located in the =XDG_CONFIG_HOME= directory instead. But, here's were we can define the actual environment.

**** XDG

#+begin_src sh
export XDG_CONFIG_HOME="$HOME/.config"
export XDG_DATA_HOME="$HOME/.local/share"
export XDG_STATE_HOME="$HOME/.local/state"
export XDG_CACHE_HOME="$HOME/.cache"
export XDG_CONFIG_DIRS=""
export XDG_DATA_DIRS=""
export XDG_RUNTIME_DIR="$TMPDIR"
#+end_src

**** Browser

#+begin_src sh
if [[ -z "$BROWSER" && "$OSTYPE" == darwin* ]]; then
  export BROWSER='open'
fi
#+end_src

**** Editors

#+begin_src sh
export LIFESTYLE="emacs" # emacs, vim

if [[ "$LIFESTYLE" == emacs ]]; then
  export EMACS_SOCKET_NAME="${XDG_RUNTIME_DIR}emacs/server"
  export EDITOR='emacsclient --create-frame --tty'
else
  export EDITOR='nvim'
fi

if [[ "$LIFESTYLE" == emacs ]]; then
  export VISUAL='emacsclient --create-frame'
else
  export VISUAL='neovide --no-fork'
fi
#+end_src

**** Pagers

#+begin_src sh
export PAGER='less'
export MANPAGER='nvim +Man!'
export MANWIDTH=999
#+end_src

**** Language

#+begin_src sh
if [[ -z "$LANG" ]]; then
  export LANG='en_US.UTF-8'
fi
#+end_src

**** Paths

#+begin_src sh
typeset -gU cdpath fpath mailpath path

path=(
  $HOME/{,s}bin(N)
  $HOME/.local/bin
  $HOME/bin
  $HOME/.config/phpmon/bin
  $HOME/.config/emacs/bin
  $HOME/.local/share/bob/nvim-bin
  /opt/{homebrew,local}/{,s}bin(N)
  /usr/local/{,s}bin(N)
  $path
)

fpath=(
  /opt/homebrew/share/zsh/site-functions
  $fpath
)
#+end_src

**** Less

#+begin_src sh
if [[ -z "$LESS" ]]; then
  export LESS='-g -i -M -R -S -w -X -z-4'
fi

if [[ -z "$LESSOPEN" ]] && (( $#commands[(i)lesspipe(|.sh)] )); then
  export LESSOPEN="| /usr/bin/env $commands[(i)lesspipe(|.sh)] %s 2>&-"
fi

export LESSHISTFILE="XDG_CONFIG_HOME"/less/history
#+end_src

**** Secrets

#+begin_src sh
if [[ -f "$HOME/.zsecrets" ]]; then
  source "$HOME/.zsecrets"
fi
#+end_src

** Yabai
:PROPERTIES:
:header-args:nushell: :tangle ~/.config/yabai/yabairc :eval no :comments link :mkdirp t
:END:

#+begin_src nushell
#!/usr/bin/env nu --login

# Settings
let padding = 16

# Load the scripting addition
sudo yabai --load-sa

# Global Settings
yabai -m config menubar_opacity 1.0                  # 0-1
yabai -m config mouse_follows_focus on               # on | off
yabai -m config focus_follows_mouse autoraise        # autofocus | autoraise | off
yabai -m config display_arrangement_order horizontal # default | vertical | horizontal
yabai -m config window_origin_display focused        # default | focused | cursor
yabai -m config window_placement first_child         # first_child | second_child
yabai -m config window_zoom_persist off              # on | off
yabai -m config window_shadow float                  # true | false | float
yabai -m config window_opacity on                    # on | off
yabai -m config window_opacity_duration 0.1          # 0-1
yabai -m config active_window_opacity 0.95           # 0-1
yabai -m config normal_window_opacity 0.80           # 0-1
yabai -m config insert_feedback_color 0x88FF0000     # 0xAARRGGBB
yabai -m config split_ratio 0.5                      # 0-1
yabai -m config split_type auto                      # vertical | horizontal | auto
yabai -m config mouse_modifier ctrl                  # cmd | alt | shift | ctrl | fn
yabai -m config mouse_drop_action stack              # swap | stack

# Space Settings
yabai -m config layout bsp                    # bsp | stack | float
yabai -m config top_padding $padding          # int
yabai -m config bottom_padding $padding       # int
yabai -m config left_padding $padding         # int
yabai -m config right_padding $padding        # int
yabai -m config window_gap $padding           # int
yabai -m config external_bar all:40:0

#
# Labeled Spaces
#
[
  primary  secondary notes messages
  meetings media     system
] | do {
  let labels = $in
  yabai -m query --spaces | from json | do {
    let spaces = $in
    ($labels | length) - ($spaces | length) | if ($in > 0) {
      seq 1 $in | each { yabai -m space --create }
    }
    $labels | enumerate | each {|x|
      yabai -m space ($x.index + 1) --label $x.item
    }
  }
}

#
# Rules
#
#[ [label app space];
#  [settings '^System Settings$' system]
#  [whatsapp WhatsApp messages]
#  [messages Messages messages]
#  [telegram Telegram messages]
#  [spotify Spotify media]
#  [clearvpn ClearVPN system]
#  [cleanmymac 'CleanMyMac X' system]
#] | each { items {|k, v| $"($k)=($v)"} | yabai -m rule --add ...$in }

# Signals
yabai -m signal --add label=reload-sa event=dock_did_restart action="sudo yabai --load-sa"
yabai -m signal --add label=focus-wez event=window_created action='yabai -m window $YABAI_WINDOW_ID --focus' app='^wezterm-gui$'
yabai -m signal --add label=spotify event=window_focused app="^Spotify$" action='yabai -m rule --apply spotify'
yabai -m signal --add label=whatsapp event=window_focused app='^WhatsApp$' action='yabai -m rule --apply whatsapp'

# Final Instructions
yabai -m rule --apply

# vim: ft=nu
#+end_src

** SKHD
:PROPERTIES:
:header-args:sh: :tangle ~/.config/skhd/skhdrc :eval no :mkdirp t :comments link
:END:

#+begin_src sh
# Setup modes
# :: default : wm mode default
# :: win @ : wm mode win
# :: spc @ : wm mode spc
# alt - return ; win
# win < s ; spc
# win < escape ; default
# spc < escape ; win
# win < shift - escape ; default
# spc < shift - escape ; default

# DEFAULT Mode
alt - 0x1E : wm space focus next # ]
alt - 0x21 : wm space focus prev # [
alt - 1 : wm space focus 1
alt - 2 : wm space focus 2
alt - 3 : wm space focus 3
alt - 4 : wm space focus 4
alt - 5 : wm space focus 5
alt - 6 : wm space focus 6
alt - 7 : wm space focus 7
alt - 8 : wm space focus 8
alt - 9 : wm space focus 9
alt - d : wm display focus next --cycle
alt - e : wm space balance
alt - h : wm window focus west
alt - i : wm window focus stack next
alt - j : wm window focus south
alt - k : wm window focus north
alt - l : wm window focus east
alt - n : wm window focus next
alt - o : wm window focus stack prev
alt - p : wm window focus prev
alt - r : wm window toggle split
alt - return : wm window zoom toggle-fullscreen
alt - s : wm space create
alt - space : wm window zoom toggle-parent
alt - u : wm window stack pop
alt - x : wm space flip-x
alt - y : wm space flip-y

alt + shift - 0x18 : wm window size ratio increase # =
alt + shift - 0x1B : wm window size ratio decrease # -
alt + shift - 0x1E : wm window space next # ]
alt + shift - 0x21 : wm window space prev # [
alt + shift - 1 : wm window space 1
alt + shift - 2 : wm window space 2
alt + shift - 3 : wm window space 3
alt + shift - 4 : wm window space 4
alt + shift - 5 : wm window space 5
alt + shift - 6 : wm window space 6
alt + shift - 7 : wm window space 7
alt + shift - 8 : wm window space 8
alt + shift - 9 : wm window space 9
alt + shift - d : wm window display cycle
alt + shift - e : wm space equalize
alt + shift - h : wm window swap west
alt + shift - j : wm window swap south
alt + shift - k : wm window swap north
alt + shift - l : wm window swap east
alt + shift - n : wm window swap next
alt + shift - p : wm window swap prev
alt + shift - r : wm space rotate cw; wm mode go-back
alt + shift - s : wm space destroy

ctrl + alt - h : wm window warp west
ctrl + alt - i : wm window stack next
ctrl + alt - j : wm window warp south
ctrl + alt - k : wm window warp north
ctrl + alt - l : wm window warp east
ctrl + alt - o : wm window stack prev
ctrl + alt - u : wm window stack pop

cmd + alt + ctrl - r : wm reload
#+end_src

* COMMENT Local Variables

# Local Variables:
# eval: (add-hook 'after-save-hook (lambda nil (org-babel-tangle)) nil t)
# End:
